Repository: Mido2610/kiet_portfolio
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Home
vi: Trang chủ

source: About
vi: Giới thiệu

source: Skills
vi: Kỹ năng

source: Experience
vi: Kinh nghiệm

source: Contact
vi: Liên hệ

source: Initializing Portfolio...
vi: Đang khởi tạo Portfolio...

source: Failed to Initialize App
vi: Không thể khởi tạo ứng dụng

source: Retry
vi: Thử lại

# hiThereIm
source: Hi there! ðŸ‘‹ I'm
vi: Xin chào! 👋 Tôi là

# kietNguyen
source: Nguyen Tuan Kiet
vi: Nguyễn Tuấn Kiệt

source: Flutter Developer
vi: Lập trình viên Flutter

source: Mobile App Developer
vi: Lập trình viên ứng dụng di động

source: FrontEnd Developer
vi: Lập trình viên FrontEnd

source: UI/UX Enthusiast
vi: Người đam mê UI/UX

# heroDescription
source: I craft responsive web interfaces using React and build cross-platform mobile apps with Flutter.
vi: Tôi phát triển giao diện web bằng React và xây dựng ứng dụng di động đa nền tảng với Flutter

source: View My Work
vi: Xem công việc của tôi

source: Contact Me
vi: Liên hệ với tôi

source: About Me
vi: Giới thiệu về tôi

source: Passionate Flutter Developer
vi: Lập trình viên Flutter đầy đam mê

# aboutDescription1
source: I'm a Frontend & Flutter Developer with a passion for coding and a love for creating practical, user-friendly web and mobile applications. I enjoy turning ideas into interactive interfaces and scalable apps that solve real-world problems and deliver real value to users.
vi: Tôi là lập trình viên Frontend & Flutter, đam mê lập trình và yêu thích việc tạo ra những sản phẩm web và mobile hữu ích, dễ sử dụng và có tính ứng dụng cao. Mình thích biến ý tưởng thành những giao diện tương tác và ứng dụng có tính mở rộng, giải quyết vấn đề thực tế và tạo ra giá trị cho người dùng.

# aboutDescription2
source: I have experience working with JavaScript (React/Next.js), Dart (Flutter), and integrating systems through RESTful APIs and gRPC. I'm also familiar with cloud services like Firebase to build fully functional and production-ready solutions.
vi: Tôi có kinh nghiệm sử dụng JavaScript, TypeScript (React), Dart (Flutter), và tích hợp hệ thống thông qua RESTful API và gRPC. Đồng thời, mình cũng quen thuộc với các dịch vụ cloud như Firebase để xây dựng giải pháp đầy đủ tính năng.

# aboutDescription3
source: I'm particularly interested in the intersection of design, performance, and user experience â€” aiming to build technology that empowers people to work better, not replaces them.
vi: Tôi đặc biệt quan tâm đến sự kết hợp giữa thiết kế, hiệu năng và trải nghiệm người dùng – hướng đến việc tạo ra công nghệ giúp con người làm việc tốt hơn, thay vì thay thế họ.

# aboutDescription4
source: Outside of work, I actively explore new technologies and keep up with the latest trends in software development.
vi: Ngoài công việc, tôi thường xuyên tìm hiểu công nghệ mới và khám phá các xu hướng mới trong lĩnh vực phần mềm

# yearsExperience
source: 1+ Years
vi: 1+ Năm

# experienceLabel
source: Experience
vi: Kinh nghiệm

source: Technologies
vi: Công nghệ

# whatIDooBest
source: What I Do Best
vi: Những gì tôi làm tốt nhất

source: Cross-Platform Development
vi: Phát triển đa nền tảng

source: Performance Optimization
vi: Tối ưu hóa hiệu suất

source: UI/UX Implementation
vi: Triển khai UI/UX

source: Backend Integration
vi: Tích hợp Backend

source: Personal Information
vi: Thông tin cá nhân

source: Location
vi: Địa điểm

# locationValue
source: Ho Chi Minh City, Vietnam
vi: Thành phố Hồ Chí Minh, Việt Nam

source: Languages
vi: Ngôn ngữ

# languagesValue
source: Vietnamese, English, Japanese
vi: Tiếng Việt, Tiếng Anh, Tiếng Nhật

source: Interests
vi: Sở thích

# interestsValue
source: Technology, Travel
vi: Công nghệ, Du lịch

source: Status
vi: Trạng thái

# statusValue
source: Available for Freelance
vi: Sẵn sàng nhận Freelance

# technologiesTitle
source: Technologies
vi: Công nghệ

# skillsDescription
source: Here are the technologies and tools which I regularly work with.
vi: Đây là những công nghệ và công cụ mà tôi thường xuyên làm việc cùng.

source: Message
vi: Tin nhắn

source: Send Me a Message
vi: Gửi tin nhắn cho tôi

# messageDescription
source: Have a question or want to work together? Send me a message and I'll get back to you as soon as possible.
vi: Có câu hỏi hoặc muốn hợp tác? Gửi tin nhắn cho tôi và tôi sẽ phản hồi sớm nhất có thể.

source: Get In Touch
vi: Liên hệ với tôi

# contactDescription
source: I'm always open to discussing new opportunities and interesting projects. Feel free to reach out!
vi: Tôi luôn sẵn sàng thảo luận về những cơ hội mới và dự án thú vị. Hãy liên hệ với tôi!

# contactMeButton
source: Contact Me
vi: Liên hệ với tôi

# englishLanguage
source: English
vi: Tiếng Anh

# vietnameseLanguage
source: Vietnamese
vi: Tiếng Việt
